{
  "low_highRes": "By 2050, Fiji has become a global model for climate resilience. Strong international cooperation kept global warming below 1.5°C, while your strategic investments in adaptation have created thriving, resilient communities. Coral reefs show signs of recovery, renewable energy powers 90% of the grid, and nature-based solutions protect coastlines. Fijian innovations in sustainable development are being replicated across the Pacific. The sounds of healthy reefs and bustling sustainable communities fill the air.",
  
  "low_lowRes": "Global emissions stayed relatively low, limiting warming to around 1.5°C, but Fiji struggled with adaptation. While climate impacts are manageable, limited resilience investments mean communities face ongoing challenges. Some coral reefs survive, but many coastal areas remain vulnerable to flooding. Economic opportunities exist in the green transition, but not all communities could adapt quickly enough. The future holds promise, but recovery will take time.",
  
  "medium_highRes": "Global warming reached 2°C by 2050, bringing significant challenges, but Fiji's strong resilience investments paid off. Advanced early warning systems, climate-smart infrastructure, and diversified economies help communities weather the storms. While coral reefs face serious stress, restoration efforts keep some areas healthy. Managed retreat from the most vulnerable coastlines was planned and supported. Fiji demonstrates that even under moderate climate change, preparation makes all the difference.",
  
  "medium_lowRes": "With global warming at 2°C and limited adaptation, Fiji faces a difficult but manageable future. Frequent flooding disrupts communities, many coral reefs are severely degraded, and traditional livelihoods struggle. Economic losses mount, but international support helps with basic needs. Some areas thrive where natural protection exists, but overall, daily life requires constant adaptation to a more unstable climate.",
  
  "high_highRes": "Despite severe global warming of 2.5°C or more, Fiji's comprehensive resilience investments provide crucial protection. While the challenges are immense - frequent severe weather, significant sea level rise, and ecosystem stress - early planning and community preparedness save lives and livelihoods. Floating cities, vertical farms, and revolutionary desalination provide hope. Fiji becomes a beacon of human ingenuity under extreme climate stress.",
  
  "high_lowRes": "By 2050, the world has warmed by 2.5°C or more, and Fiji faces the worst-case scenario. With limited preparation, rising seas and intensifying storms overwhelm communities. Most coral reefs have collapsed, food security is threatened, and mass displacement is common. International climate refugees join displaced Fijians in search of safety. Traditional ways of life are largely lost, and survival becomes the primary focus in this drastically altered world."
}